# utils/editor.py

import asyncio
import re
import os
from aiogram import Bot
from aiogram.client.default import DefaultBotProperties
from dotenv import load_dotenv

# Загружаем токен из .env
load_dotenv()
BOT_TOKEN = os.getenv("BOT_TOKEN")

bot = Bot(token=BOT_TOKEN, default=DefaultBotProperties(parse_mode="HTML"))

def parse_group_link(link: str) -> tuple[int, int]:
    m = re.search(r"t\.me/c/(\d+)/(\d+)", link)
    if not m:
        raise ValueError("Неверный формат ссылки")
    chat_id = int("-100" + m.group(1))   # правильно!
    msg_id = int(m.group(2))
    return chat_id, msg_id

async def edit_group_message(group_link: str, new_text: str) -> bool:
    try:
        group_chat, group_msg_id = parse_group_link(group_link)

        await bot.edit_message_text(
            chat_id=group_chat,
            message_id=group_msg_id,
            text=new_text
        )
        print(f"Сообщение {group_msg_id} в чате {group_chat} обновлено")
        return True
    except Exception as e:
        print(f"Ошибка при редактировании: {e}")
        return False
    finally:
        await bot.session.close()

async def main():
    group_link = "https://t.me/c/1102663807/40322"

    new_text = """‼️Вебинар 6 ноября 2025 (четверг)
📌12:30 – 13:30 CET (московское время MSK 14:30 – 15:30)

Cкрипт как сценарий успеха – повышение квалификации и автоматизация с ESAPI

🔗 <a href="https://web.cvent.com/event/67e194e2-25a1-4100-991c-819a4261bd53/regProcessStep1?mkt_tok=...">Ссылка</a> для регистрации

💬Вебинар посвящен преимуществам использования скриптов в лучевой терапии

ℹ️Присоединяйтесь, чтобы принять участие в 60-минутной сессии и узнать, как скриптинг в ESAPI преобразует рабочие процессы в лучевой терапии.
На вебинаре выступят Эрик Фура из Västmanlands sjukhus Västerås и Шрирам Падманабан из Oxford University Hospital NHS Trust. Они поделятся своим экспертным мнением о том, как использование скриптов способствует стандартизации, повышению эффективности и улучшению качества лечения пациентов.

✔️Темы вебинара:
• Развитие навыков работы в ESAPI: узнайте, как клинические команды овладевают навыками работы со скриптами для оптимизации процессов лучевой терапии.
• Автоматизация в действии: узнайте, как скрипты для планирования терапии сокращают объем ручной работы, сводят к минимуму риск ошибки из-за человеческого фактора и оптимизируют рабочие процессы.
• Ключевые преимущества: стандартизация, увеличение эффективности и повышение безопасности в практике лучевой терапии.

📎При регистрации может потребоваться сбор и обработка персональных данных, таких как имя, адрес электронной почты, номер телефона, место работы, функциональная роль и т. д.

#образование

Источник: @MedPhysProChannel"""

    await edit_group_message(group_link, new_text)

if __name__ == "__main__":
    asyncio.run(main())